Repository: A-SunsetMkt-Forks/fsearch
Catalog: po/*.po
Languages: es

source: <b>Restore default filters:</b> This button restores the default filter configuration. ⚠ All filters which were created or edited by the user will be lost! ⚠
es: <b>Restaurar filtros predeterminados:</b> Este botón restaura la configuración del filtro por defecto. ⚠ ¡Todos los filtros creados o editados por el usuario se perderán! ⚠

source: <b>Exit on Escape:</b> If enabled, FSearch exits when the Escape key is pressed instead of the window being minimized.
es: <b>Salir con Escape:</b> Si está habilitado, FSearch se cierra cuando se pulsa la tecla Escape en lugar de minimizar la ventana.

source: Help
es: Ayuda

source: Select folder
es: Seleccione la carpeta

source: _Select
es: Seleccionar

source: Add filter
es: Añadir filtros

source: Active
es: Activar

source: Path
es: Ruta

source: One Filesystem
es: Un sistema de archivos

source: Name
es: Nombre

source: Query
es: Consulta

source: %'d Item
es: %'d elemento

source: %'d Items
es: %'d elementos

source: Querying…
es: Consultando…

source: Loading…
es: Cargando…

source: Scanning…
es: Escaneando…

source: Number of Search Results
es: Cantidad de resultados

source: 0 Items
es: 0 elementos

source: Cancel
es: Cancelar

source: Index:
es: Índice:

source: Number of selected folders
es: Cantidad de carpetas seleccionadas

source: Number of selected files
es: Cantidad de ficheros seleccionados

source: Cancel database update
es: Cancelar la actualización de la base de datos

source: Number of database items
es: Cantidad de elementos en la base de datos

source: (empty)
es: (vacío)

source: Search term contains upper case characters. <b>Match Case</b> was temporarily activated for this term.
es: El término de búsqueda contiene letras mayúsculas. <b>Buscar en la ruta</b> se activó temporalmente para este término.

source: CASE
es: MAYÚSCULAS

source: Search term contains path separators. <b>Search in Path</b> was temporarily activated for this term.
es: El término de búsqueda contiene separadores de ruta. <b>Buscar en la ruta</b> se activó temporalmente para este término.

source: PATH
es: RUTA

source: REGEX
es: EXPRESIONES REGULARES

source: Size
es: Tamaño

source: Type
es: Tipo

source: Extension
es: Extensión

source: Date Modified
es: Fecha de modificación

source: Sorting by <b>Type</b> can take a few seconds with many results. This sort order is not persistent, it will be reset when the search term changes.
es: Ordenar por <b> Tipo </b> puede tardar unos segundos con muchos resultados. Este orden de clasificación no es persistente, se restablecerá cuando cambie el término de búsqueda.

source: New window
es: Nueva ventana

source: Update database
es: Actualizar base de datos

source: Search in Path
es: Buscar en la ruta

source: Match Case
es: Distinguir mayúsculas y minúsculas

source: Enable RegEx
es: Activar expresiones regulares

source: Show Statusbar
es: Mostrar barra de estado

source: Show Filter
es: Mostrar filtro

source: Show Search Button
es: Mostrar botón de busca

source: FSearch Online
es: FSearch en línea

source: About
es: Acerca de

source: Quit
es: Salir

source: Donate
es: Donar

source: Forum
es: Foro

source: Bug Reports and Feature Requests
es: Informes de errores y solicitud de funciones

source: GitHub Sponsors
es: Patrocinadores en GitHub

source: Search…
es: Buscar…

source: Select a Filter
es: Seleccione un filtro

source: Do you really want to open %d file(s)?
es: ¿En verdad quiere abrir %d archivo(s)?

source: Opening Files…
es: Abrir archivo(s)…

source: Do you really want to remove %d file(s)?
es: ¿En verdad quiere eliminar %d archivo(s)?

source: Deleting files…
es: Eliminando archivos…

source: Moving files to trash…
es: Enviando archivos a la papelera…

source: Something went wrong.
es: Algo salió mal.

source: Deleted %d file(s).
es: Eliminado(s) %d archivo(s).

source: Moved %d file(s) to the trash.
es: Movido %d archivo(s) a la basura.

source: The database needs to be updated before it becomes aware of those changes! This will be fixed with future updates.
es: ¡La base de datos debe actualizarse antes de que los cambios sean notados! Esto se solucionará con futuras actualizaciones.

source: Do you really want to open %d file property windows?
es: ¿En verdad quiere abrir %d ventanas de propiedades de archivo?

source: Opening file properties…
es: Abrir propiedades de archivo…

source: _File
es: _Archivo

source: New Window
es: Ventana nueva

source: _Open
es: _Abrir

source: Open Folder
es: Abrir carpeta

source: Update Database
es: Actualizar base de datos

source: Cancel Update
es: Cancelar actualización

source: Close Window
es: Cerrar ventana

source: _Edit
es: _Editar

source: _Copy
es: _Copiar

source: Cu_t
es: Cor_tar

source: Select All
es: Seleccionar todo

source: Deselect All
es: Desmarcar todo

source: Invert Selection
es: Invertir selección

source: _View
es: _Ver

source: _Search
es: _Buscar

source: _Help
es: Ay_uda

source: Open _With
es: Abrir _con

source: _Open Folder
es: _Abrir carpeta

source: Copy as Text
es: Copiar como texto

source: Path + Name
es: Ruta + Nombre

source: Move to _Trash
es: Enviar a la _papelera
