Repository: A-SunsetMkt-Forks/fsearch
Catalog: po/*.po
Languages: es

source: A file search application focusing on performance and advanced features
es: Herramienta de búsqueda centrada en la velocidad y con prestaciones avanzadas

source: search;fsearch;files;folders;music;video;documents;find;tool;everything;
es: buscar;fsearch;archivos;carpetas;música;video;documentos;encontrar;herramienta;todo;

source: A graphical file search application
es: Una aplicación gráfica para buscar archivos

source: FSearch helps you to find files and folders as easy and fast as possible. Just type a few letters and search results will appear almost instantly.
es: FSearch le ayuda a encontrar archivos y carpetas de la forma más fácil y rápida posible. Solo tiene que escribir unas cuantas letras y los resultados de la búsqueda aparecerán casi al instante.

source: Regular expressions
es: Expresiones regulares

source: Wildcard support
es: Admitir caracteres comodín

source: Filter support (e.g. only search for audio files)
es: Admitir filtros (p. ej., para buscar solo archivos de audio)

source: Exclude certain files and folders
es: Excluir determinados archivos y carpetas

source: Fast sort by name, path, size, modification time and extension
es: Ordenación rápida por nombre, ruta, tamaño, fecha de modificación y extensión

source: The default UI layout
es: El diseño de la interfaz por defecto

source: A layout more closely following GNOME HIGs
es: Un diseño más cercano a las directrices de GNOME

source: Initial release.
es: La versión inicial.

source: Saving…
es: Guardando…

source: translator-credits
es: Arturo Martínez Eugenio Monforte Toni Estévez

source: A search utility focusing on performance and advanced features
es: Una herramienta de búsqueda rápida con prestaciones avanzadas

source: Open a new application window
es: Abrir una ventana nueva de la aplicación

source: Show the application preferences
es: Mostrar las preferencias de la aplicación

source: Set the search pattern
es: Definir el patrón de búsqueda

source: Update the database and exit
es: Actualizar la base de datos y salir

source: Print version information and exit
es: Mostrar información de la versión y salir

source: Loading folders…
es: Cargando carpetas…

source: Loading files…
es: Cargando archivos…

source: Sorting…
es: Ordenando…

# Will be followed by the path of the file.
source: Error when removing file
es: Error al eliminar el archivo

source: Failed to get path
es: No se pudo obtener la ruta

source: Failed to get application information
es: No se pudo obtener la información sobre la aplicación

# Will be followed by the content type string.
source: Error when getting information for content type
es: Error al obtener información sobre el tipo de contenido

source: No default application registered
es: No se registró ninguna aplicación predeterminada

# Will be followed by the path of the folder.
source: Error when opening parent folder
es: Error al abrir la carpeta contenedora

source: Failed to get parent path
es: No se pudo abrir la ruta contenedora

# Will be followed by the path of the folder.
source: Error while opening folder
es: Error al abrir la carpeta

source: Failed to build open command
es: No se pudo compilar la orden de apertura

source: Folder
es: Carpeta

source: Unknown Type
es: Tipo desconocido

source: All
es: Todo

source: Folders
es: Carpetas

source: Files
es: Archivos

source: Applications
es: Aplicaciones

source: Archives
es: Archivadores

source: Documents
es: Documentos

source: Pictures
es: Imágenes

source: Videos
es: Vídeos

source: Macro names must not contain `:` characters.
es: Los nombres de las macros no deben contener caracteres `:`.

source: _Cancel
es: Cancelar

source: _OK
es: _Sí

source: Edit filter
es: Editar filtro

source: Name:
es: Nombre:

source: The unique name of this filter
es: El nombre único de este filtro

source: Unique filter name
es: Nombre del filtro único

source: Search in path
es: Buscar en la ruta

source: Enable regular expressions
es: Habilitar expresiones regulares

source: Match case
es: Distinguir mayúsculas y minúsculas

source: Query:
es: Consulta:

source: The macro for this filter. A macro allows you to access this filter from the search entry by typing its text followed by ':'
es: La macro para este filtro. Una macro le permite acceder a este filtro desde la entrada de búsqueda al escribir su texto seguido de ':'

source: Properties…
es: Propiedades…

source: Other Application…
es: Otra aplicación…

source: Empty Database
es: Base de datos vacía

source: Add folders
es: Añadir carpetas

source: Loading Database…
es: Cargando la base de datos…

source: This won't take long.
es: Esta acción no llevará mucho tiempo.

source: Updating Database…
es: Actualizando la base de datos…

source: This may take a while.
es: Esta acción puede demorar un rato.

source: Empty Query
es: Consulta vacía

source: Press <b>Ctrl + F</b> and start typing.
es: Presione <b>Ctrl + F</b> y comience a escribir.

source: No Results Found
es: No se ha encontrado ningún resultado

source: Try a different search
es: Pruebe con otra búsqueda

source: Sorting results…
es: Ordenando los resultados…

source: Preferences
es: Preferencias

source: Enable dark theme
es: Activar tema oscuro

source: Enable client-side decorations (requires restart)
es: Habilitar Client Side Decoration (requiere reinicio)

source: Use binary units instead of decimal units
es: Utilizar unidades binarias en lugar de decimales

source: Remember window size
es: Recordar tamaño de la ventana

source: Exit on Escape
es: Salir con Escape

source: with keyboard shortcuts or menu entries
es: Con atajos del teclado o entradas de menú

source: with double click
es: Con doble clic

source: Behaviour after successfully opening a file:
es: Comportamiento tras abrir un archivo con éxito:

source: Nothing
es: Nada

source: Minimize
es: Minimizar

source: Close
es: Cerrar

source: Show highlighted search terms
es: Mostrar términos de búsqueda resaltado

source: Show tooltips
es: Mostrar descripciones emergentes

source: Show icons in name column
es: Mostrar iconos en la columna Nombre

source: Remember column configuration
es: Recordar configuración de columnas

source: Remember sort order
es: Recuerde el orden de clasificación

source: Open path with double click in path column
es: Abrir ruta con doble clic en la columna Ruta

source: Single click to open
es: Abrir con un clic

source: Launch desktop files
es: Iniciar archivos del escritorio

source: Results:
es: Resultados:

source: Show database indexing status
es: Mostrar el estado del indexado de la base de datos

source: Statusbar:
es: Barra de estado:

source: Show warning dialogs when:
es: Mostrar advertencias cuando:

source: file / folder failed to open
es: No se pudo abrir archivo / carpeta

source: Dialogs:
es: Diálogos:

source: Interface
es: Interfaz

source: Search in path when query contains path separators
es: Buscar en la ruta cuando la consulta tenga separadores de ruta

source: Search as you type
es: Buscar mientras escribe

source: Hide results when search is empty
es: Ocultar resultados cuando la búsqueda esté vacía

source: Match case when query contains at least one upper case character
es: Coincidencia de mayúsculas y minúsculas cuando la consulta contiene al menos un carácter en mayúsculas

source: Add new filter
es: Agregar nuevo filtro

source: Remove selected filter
es: Eliminar el filtro seleccionado

source: Edit selected filter
es: Editar filtros seleccionados

source: Restore default filters
es: Restaurar los filtros predeterminados

source: Filter:
es: Filtro:

source: Search
es: Buscar

source: Update database on start
es: Actualizar base de datos al inicio

source: Update every
es: Actualizar cada

source: hour(s) and
es: hora(s) y

source: minute(s)
es: minuto(s)

source: Add path to be included in database
es: Agregar ruta para ser incluido en la base de datos

source: Remove selected path
es: Eliminar la ruta seleccionada

source: Include
es: Incluir

source: Add path to be excluded from database
es: Agregar ruta para ser excluida de la base de datos

source: Supports wildcards. Multiple entries must be separated by ';'
es: Admite comodines. Separe las entradas mediante «;»

source: Exclude files:
es: Excluir archivos:

source: e.g. ".git;*.tmp"
es: p. ej., «.git;*.tmp»

source: Exclude hidden files and folders
es: Excluir archivos y carpetas ocultos

source: Exclude
es: Excluir

source: Database
es: Base de datos

source: <b>Enable dark theme:</b> If enabled, the system theme is asked to use a darker styling for the application <i>(i.e. dark UI elements on bright text)</i>. Note that not all system themes provide such a darker variant, therefore enabling this setting might not have an effect.
es: <b>Activar tema oscuro:</b> Si está habilitado, se pide al tema del sistema que utilice un estilo más oscuro para la aplicación <i>(es decir, elementos de interfaz de usuario oscuros en texto brillante)</i>. Tenga en cuenta que no todos los temas del sistema proporcionan una variante más oscura, por lo que habilitar esta configuración podría no tener efecto.

source: <b>Enable client-side decorations:</b> If enabled, the search entry and main menu are displayed in the window title bar. If disabled, the main menu is displayed as a menu bar with the search entry below it. This resembles a more traditional UI layout and takes a little bit more space.
es: <b>Habilitar Client Side Decorations:</b> Si está activada, la entrada de búsqueda y el menú principal se muestran en la barra de título de la ventana. Si está desactivado, el menú principal se muestra como una barra de menús con la entrada de búsqueda debajo de él. Esto se asemeja a un diseño de interfaz de usuario más tradicional y toma un poco más de espacio.

source: <b>Use binary units instead of decimal units:</b> This settings controls how file sizes are displayed. • <b>Binary units:</b> This refers to binary IEC prefixes <i>(e.g. 1 KiB = 1024 bytes)</i> • <b>Decimal units:</b> This refers to decimal SI prefixes <i>(e.g. 1 kB = 1000 bytes)</i>
es: <b>Utilizar unidades binarias en lugar de unidades decimales:</b> Esta configuración controla cómo se muestran los tamaños de archivo. • <b>Unidades binarias:</b> Esto se refiere a los prefijos binarios <i>(p. ej. 1 KiB = 1024 bytes)</i> • <b>Unidades decimales:</b> Esto se refiere a los prefijos del SI <i>(p. ej. 1 kB = 1000 bytes)</i>

source: <b>Remember window size:</b> If enabled, the window size from the previous session will be restored when you open an FSearch window. Note that some window managers ignore this request and force the window to have a different size.
es: <b>Recordar tamaño de la ventana:</b> Si está habilitado, el tamaño de la ventana de la sesión anterior se restaurará al abrir una ventana de FSearch. Tenga en cuenta que algunos administradores de ventanas ignoran esta solicitud y fuerzan la ventana a tener un tamaño diferente.

source: <b>Behaviour after successfully opening a file:</b> When a file/folder was successfully opened one of the following actions can be performed: • <b>Nothing:</b> Nothing happens. • <b>Minimize:</b> The currently selected FSearch window becomes minimized. • <b>Close:</b> Quit FSearch. You can configure if those actions should be triggered when the file was opened with • <b>keyboard shortcuts or menu entries</b> and/or • <b>mouse click</b>
es: <b>Comportamiento después de abrir correctamente un archivo:</b> Cuando se abre correctamente un archivo/carpeta, se puede realizar una de las siguientes acciones: • <b>Nada:</b> No sucede nada. • <b>Minimizar:</b> La ventana de FSearch actualmente seleccionada se minimiza. • <b>Cerrar:</b> Salir de FSearch. Puede configurar si esas acciones deben activarse cuando se abre el archivo con • <b>atajos de teclado o entradas de menú</b> y/o • <b>clic del ratón</b>

source: <b>Show highlighted search terms:</b> If enabled, the search terms will be highlighted in the results view. For example when you search for "foo" all appearances of <i>foo</i> in file/folder names will be highlighted with bold characters: <b>foo</b>bar.txt file.<b>foo</b> This also works for regular expressions and wildcard expressions starting or ending with an asterisk.
es: <b>Mostrar términos de búsqueda resaltado:</b> Si está habilitado, los términos de búsqueda se resaltarán en la vista de resultados. Por ejemplo, al buscar "fu" todas las apariciones de <i>fu</i> en los nombres de archivos/carpetas se resaltarán con caracteres en negrita: <b>fu</b>lano.txt archivo.<b>fu</b> Esto también funciona para expresiones regulares y expresiones comodín que comienzan o terminan con un asterisco.

source: <b>Show tooltips:</b> If enabled, the results view will show the full path of the focused file/folder in a small tooltip window.
es: <b>Mostrar descripciones emergentes:</b> Si está habilitada, la vista de resultados mostrará la ruta de acceso completa del archivo/carpeta enfocado en una pequeña ventana de información emergente.

source: <b>Show icons in name column:</b> If enabled, file/folder icons will be shown in the name column.
es: <b>Mostrar iconos en la columna Nombre:</b> Si está habilitado, los iconos de archivos/carpetas se mostrarán en la columna Nombre.

source: <b>Remember column configuration:</b> If enabled, the column configuration of the results view from the previous session will be restored when you open an FSearch window. This includes the size and visibility of all columns.
es: <b>Recordar configuración de columnas:</b> Si está habilitada, la configuración de columnas de la vista de resultados de la sesión anterior se restaurará al abrir una ventana de FSearch. Esto incluye el tamaño y la visibilidad de todas las columnas.

source: <b>Remember sort order:</b> If enabled, the sort order of the results view from the previous session will be restored when you open an FSearch window.
es: <b>Recuerde el orden de clasificación:</b> Si está habilitada, el ordenamiento de la vista de resultados de la sesión anterior se restaurará cuando abra una nueva ventanda de FSearch.

source: <b>Open path with double click in path column:</b> If enabled, double clicking in the path column will open the selected path.
es: <b>Abrir ruta con doble clic en la columna Ruta:</b> Si está habilitado, al hacer doble clic en la columna de ruta se abrirá la ruta seleccionada.

source: <b>Show database indexing status:</b> If enabled, the path that is currently being indexed is displayed in the statusbar.
es: <b>Mostrar el estado del indexado de la base de datos:</b> Si está habilitada, la ruta de acceso que se está indexando actualmente se muestra en la barra de estado.

source: <b>Show warning dialogs:</b> If enabled, a warning dialog is displayed when a file or folder failed to open.
es: <b>Mostrar advertencias:</b> Si está habilitado, se mostrará un cuadro de diálogo de advertencia cuando un archivo o carpeta no se pudo abrir.

source: <b>Search in path when query contains path separators:</b> If enabled, search terms containing path separators (i.e. "/") will be automatically matched against the full path of a file or folder.
es: <b>Buscar en la ruta cuando la consulta tenga separadores de ruta:</b> Si está habilitado, los términos de búsqueda que contienen separadores de ruta (p. ej. "/") se compararán automáticamente con la ruta completa de un archivo o carpeta.

source: <b>Match case when query contains at least one upper case character:</b> If enabled, search terms containing at least one upper case character will trigger a case-sensitive search. This means a search term like <i>Foo</i> will match <i>FooBar.txt</i> but not <i>foobar.txt</i>.
es: <b>Coincidir mayúsculas y minúsculas cuando la consulta contiene al menos un carácter en mayúsculas:</b> Si está habilitado, los términos de búsqueda que contengan al menos un carácter en mayúscula provocará una búsqueda sensible a mayúsculas y minúsculas. Esto significa que un término de búsqueda como <i>Fu</i> coincidirá con <i>Fulano.txt</i> pero no <i>fulano.txt</i>.

source: <b>Hide results when search is empty:</b> If enabled, no search results are displayed when the search entry is empty. If disabled, all files and folders will be displayed when the search entry is empty.
es: <b>Ocultar resultados cuando la búsqueda esté vacía:</b> Si está habilitado, no se muestra ningún resultado de búsqueda cuando la entrada de búsqueda esté vacía. Si está deshabilitada, todos los archivos y carpetas se mostrarán cuando la entrada de búsqueda esté vacía.

source: <b>Search as you type:</b> If enabled, the search is automatically updated with every keystroke. If disabled, the search is only updated when you hit <i>Enter</i> or press the search button.
es: <b>Buscar mientras escribe:</b> Si está habilitado, la búsqueda se actualiza automáticamente con cada pulsación de tecla. Si está deshabilitada, la búsqueda solo se actualiza cuando presiona <i> Enter </i> o presiona el botón de búsqueda.

source: <b>Update database on start:</b> If enabled, the database will be updated automatically in the background when you start FSearch.
es: <b>Actualizar base de datos al inicio:</b> Si está habilitada, la base de datos se actualizará automáticamente en segundo plano al iniciar FSearch.

source: <b>Included folders:</b> This list contains all folders you want to include in the database. • <b>Active:</b> If enabled, the path will included in the database to be searched in. • <b>Path:</b> The full path to be included. • <b>One Filesystem:</b> If enabled, FSearch won't cross filesystem boundaries for this folder
es: <b>Carpetas incluidas:</b> Esta lista contiene todas las carpetas que desea incluir en la base de datos. • <b>Activo:</b> Si está habilitada, la ruta de acceso se incluirá en la base de datos y se podrá buscar en ella. • <b>Ruta:</b> La ruta completa para ser incluida. • <b>Sistema de archivos único:</b> Si está habilitado, FSearch no cruzará los límites del sistema de archivos para esta carpeta

source: <b>Add folder to database:</b> This button opens a dialog where you can select a folder you want to include in the database for searching.
es: <b>Incluir carpeta en la base de datos:</b> Este botón abre un cuadro de diálogo donde puede seleccionar una carpeta que desea incluir en la base de datos para la búsqueda.

source: <b>Remove selected row:</b> This removes the selected folder from the list of included folders.
es: <b>Eliminar la fila seleccionada:</b> Esto elimina la carpeta seleccionada de la lista de carpetas incluidas.

source: <b>Excluded folders:</b> This list contains all folders you want to exclude from the database. • <b>Active:</b> If enabled, the path will excluded from the database and can't be searched in. • <b>Path:</b> The full path to be excluded.
es: <b>Carpetas excluidas:</b> Esta lista contiene todas las carpetas que desea excluir de la base de datos. • <b>Activo:</b> Si está habilitada, la ruta de acceso se excluirá de la base de datos y no se podrá buscar en ella. • <b>Ruta:</b> La ruta completa para ser excluida.

source: <b>Exclude folder from database:</b> This button opens a dialog where you can select a folder you want to exclude from the database.
es: <b>Excluir carpeta de la base de datos:</b> Este botón abre un cuadro de diálogo donde puede seleccionar una carpeta que desea excluir de la base de datos.

source: <b>Remove selected row:</b> This removes the selected folder from the list of excluded folders.
es: <b>Eliminar la fila seleccionada:</b> Esto elimina la carpeta seleccionada de la lista de carpetas excluidas.

source: <b>Exclude files and folders from database:</b> This is a semi-colon separated list of files (or folders) you want to exclude from the database. For example <i>.git;.cache;*.swp</i> will exclude all files or folders which are called either <i>.git</i> or <i>.cache</i> or end with <i>.swp</i>.
es: <b>Excluir archivos y carpetas de la base de datos:</b> Se trata de una lista separada por punto y coma de los archivos (o carpetas) que desea excluir de la base de datos. Por ejemplo <i>.git;.cache;*.swp</i> excluirá todos los archivos o carpetas que se llaman <i>.git</i> o <i>.cache</i> o terminan con <i>.swp</i>.

source: <b>Exclude hidden files and folders:</b> If enabled, hidden files and folders will be excluded from the database <i>(i.e. all files or folders which start with a dot character)</i>.
es: <b>Excluir archivos y carpetas ocultos:</b> Si está habilitado, los archivos y carpetas ocultos se excluirán de la base de datos. <i>(es decir, todos los archivos o carpetas que comienzan con un carácter de punto).</i>.

source: Focus a setting to get a detailed description of what it does.
es: Enfoque una configuración para obtener una descripción detallada de lo que hace.

source: <b>Periodically update database at a specific time interval:</b> If enabled and as long as FSearch is running, the database will be updated periodically with the given time interval. If you want to update the database in the background, even when FSearch is not running, you should use tools like cron or systemd timers to periodically trigger the update with: <i><tt>fsearch --update-database</tt></i>
es: <b>Actualizar periódicamente la base de datos en un intervalo de tiempo específico:</b> Si está habilitado y mientras FSearch esté en ejecución, la base de datos se actualizará periódicamente con el intervalo de tiempo dado. Si desea actualizar la base de datos en segundo plano, incluso cuando FSearch no está ejecución, debe usar herramientas como cron o Systemd timer para activar periódicamente la actualización con: <i><tt>fsearch --update-database</tt></i>

source: <b>Launch desktop files:</b> If enabled, activating a <i>.desktop</i> file will launch the application defined within that file. This way FSearch can act like an application launcher. Otherwise the <i>.desktop</i> file will be opened with the default handler for this type of files, which is usually a text editor.
es: <b>Iniciar archivos del escritorio:</b> Si está habilitado, la activación de un archivo <i>.desktop</i> iniciará la aplicación definida dentro de ese archivo. De esta manera, FSearch puede actuar como un lanzador de aplicaciones. En caso contrario, el archivo <i>.desktop</i> se abrirá con el manipulador por defecto para este tipo de archivos, que suele ser un editor de texto.

source: <b>Filters:</b> This is a list of all available filters. A filter is a predefined search. • <b>Name:</b> A unique and descriptive identifier for the filter • <b>Macro:</b> By typing the macro text followed by a ':' you can enable the filter on demand • <b>Query:</b> The search term by which the database should be filtered
es: <b>Filtros:</b> Esta es una lista de todos los filtros disponibles. Un filtro es una búsqueda predefinida. • <b>Nombre:</b> Un identificador único y descriptivo para el filtro • <b>Macro:</b> Escribiendo el texto de la macro seguido de un ':' puede habilitar el filtro pedido • <b>Consulta:</b> El término de búsqueda por el que se debe filtrar la base de datos

source: <b>Add a new filter:</b> This button opens a dialog where you can edit a new filter.
es: <b>Añadir un nuevo filtro:</b> Este botón abre un cuadro de diálogo donde puede editarse un nuevo filtro.

source: <b>Remove selected filter:</b> This button removes the currently selected filter.
es: <b>Eliminar el filtro seleccionado:</b> Este botón elimina el filtro actualmente seleccionado.

source: <b>Edit selected filter:</b> This button opens a dialog where you can edit the selected filter.
es: <b>Editar filtro seleccionado:</b> Este botón abre un cuadro de diálogo donde se puede editar el filtro seleccionado.
